#include <stdio.h>
#include "main.h"

void print_hello()
{
	printf("hello uriiy");
}

/**
 * @brief преобразование строки символов в число
 * разбираем строку от 0 до 11 символов челого положительного десятичного или шестнадцатеричного
 * формата 0123456789+cr или 0x01234567+cr
 *
 * @param str - указатель на строку
 * @return uint32_t - результат преобразования
 */
uint32_t strtoint(char *str)
{
	int lenarg = 11;		//максимальная длинна строки аргумента в символах
	char ts[11] = {0};	//массив строки для обработки
	char ps = 0;			//временная переменная
	int is = 0;				//порядковый номер анализируемого символа из строки
	int ls = 0;				//длинна строки
	uint32_t rezult = 0; //результат преобразования
	int lshift = 0;		//маска для сдвига разрядов на декаду для суммирования (шестнадцатеричные)
	int muld = 1;			//множитель для значащих цифр для суммирования	(десятичные)
	int error = 0;			//признак ошибки
	int signum = 0;		//знак числа если задано как десятичное
	//разложим строку на символы, перебираем до 0 (конца строки)
	do
	{
		ps = *str;	 //получим первый символ
		ts[is] = ps; //сохраним
		is++;
		str++;

		if (is > lenarg) //если больше максимальной длинны то выход с ошибкой
		{
			ts[is] = 0x00; //завершаем строку принудительно
			error = 1;
			break; //выходим из цикла
		}
	} while (ps != 0x00); //'0');	//до конца строки, пока не 0
	ls = is - 1;			 //получим длинну строки

	//проверим число задано как десятичное или шестнадцатеричное
	if ((ts[0] == '0') && ((ts[1] == 'x') || (ts[1] == 'X')))
	{ //если первые символы "0x" или "0X" обрабатываем как шестнадцатеричное
		//с конца начнем вносить данные ls - 1
		ls--; //так как последний символ конца строки =0, начинаем с предпоследнего значащего
		do
		{
			if (((ts[ls] >= '0') && (ts[ls] <= '9')) || //если переменная находится в требуемом диапазоне, то
				 ((ts[ls] >= 'a') && (ts[ls] <= 'f')) || //делаем преобразование
				 ((ts[ls] >= 'A') && (ts[ls] <= 'F')))	  //если нет то ошибку выдаем
			{
				if (ts[ls] == '0')
				{
					rezult += (0x0 << lshift);
				}
				if (ts[ls] == '1')
				{
					rezult += (0x1 << lshift);
				}
				if (ts[ls] == '2')
				{
					rezult += (0x2 << lshift);
				}
				if (ts[ls] == '3')
				{
					rezult += (0x3 << lshift);
				}
				if (ts[ls] == '4')
				{
					rezult += (0x4 << lshift);
				}
				if (ts[ls] == '5')
				{
					rezult += (0x5 << lshift);
				}
				if (ts[ls] == '6')
				{
					rezult += (0x6 << lshift);
				}
				if (ts[ls] == '7')
				{
					rezult += (0x7 << lshift);
				}
				if (ts[ls] == '8')
				{
					rezult += (0x8 << lshift);
				}
				if (ts[ls] == '9')
				{
					rezult += (0x9 << lshift);
				}
				if ((ts[ls] == 'a') || (ts[ls] == 'A'))
				{
					rezult += (0x0A << lshift);
				}
				if ((ts[ls] == 'b') || (ts[ls] == 'B'))
				{
					rezult += (0x0B << lshift);
				}
				if ((ts[ls] == 'c') || (ts[ls] == 'C'))
				{
					rezult += (0x0C << lshift);
				}
				if ((ts[ls] == 'd') || (ts[ls] == 'D'))
				{
					rezult += (0x0D << lshift);
				}
				if ((ts[ls] == 'e') || (ts[ls] == 'E'))
				{
					rezult += (0x0E << lshift);
				}
				if ((ts[ls] == 'f') || (ts[ls] == 'F'))
				{
					rezult += (0x0F << lshift);
				}
			}
			else
			{
				error = 1;
				break;
			}
			ls--;			 //двигаемся от младшего к старшим символам
			lshift += 4; //к следующей тетраде	разрядов
		} while (ls > 1);
	}
	else
	{
		ls--; //так как последний символ конца строки =0, начинаем с предпоследнего значащего
		do
		{
			if ((ts[ls] >= '0') && (ts[ls] <= '9')) //если переменная находится в требуемом диапазоне, то
			{
				if (ts[ls] == '0')
				{
					rezult += (0 * muld);
				}
				if (ts[ls] == '1')
				{
					rezult += (1 * muld);
				}
				if (ts[ls] == '2')
				{
					rezult += (2 * muld);
				}
				if (ts[ls] == '3')
				{
					rezult += (3 * muld);
				}
				if (ts[ls] == '4')
				{
					rezult += (4 * muld);
				}
				if (ts[ls] == '5')
				{
					rezult += (5 * muld);
				}
				if (ts[ls] == '6')
				{
					rezult += (6 * muld);
				}
				if (ts[ls] == '7')
				{
					rezult += (7 * muld);
				}
				if (ts[ls] == '8')
				{
					rezult += (8 * muld);
				}
				if (ts[ls] == '9')
				{
					rezult += (9 * muld);
				}
			}
			else
			{
				if (ts[0] == '-')
				{
					signum = 1; //признак отрицательного числа
					break;
				}
				else if (ts[0] == '+')
				{
					signum = 0; //признак положительного числа
					break;
				}
				else
				{
					error = 1;
					break;
				}
			}
			ls--;			//двигаемся от младшего к старшим символам
			muld *= 10; //к следующей тетраде	разрядов
		} while (ls >= 0);
	}

	if (signum == 1)
	{
		rezult = 0 - rezult;
	} //если число было отрицательным
	if (error == 1)
	{
		rezult = 0;
	} //если ошибка есть, вернем 0 без затей

	return rezult; //возвращаем результат преобразования
}